//////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Измерение напряжения 
// Дата крайнего редактирования 19.04.2017
//////////////////////////////////////////////////////////////////////////////////////////////////////////////

#include "adc.h"

//измерение напряжения
 uint16_t adc_measurement(void){
 
	uint16_t adc;
	POWER_ON_PIN(POWER_DIV_PIN);   //включаем делитель  
	
	ADCSRA = (1<<ADEN)|(1<<ADSC)|(1<<ADPS2)|(1<<ADPS1)|(1<<ADPS0); // настройка регистров АЦП - канал PC3(ADC3)
	while (~ADCSRA & (1<<ADIF));           						 //пока не закончится измерение (не поднят флаг
	ADCSRA = 0;
	
    // Снятие питания с резистивного делителя напряжения для экономии батареи
    POWER_OFF_PIN(POWER_DIV_PIN);  
	
	adc = ADCL;
	adc |= (ADCH<<8);
	
    // Возврат значения регистра ADC
	return adc;
	
}

 

// ВЫчисление заряда батареи на основе данных АЦП
// возвращаемое значение - уроень батареи в процентах
uint8_t ADC_to_battery_percent(uint16_t adc) {
    // при значении меньше заданного минимума  - 0 %
    if (adc <= MIN_BATTERY_ADC)
        return 0;
        
    adc -= MIN_BATTERY_ADC;

    // при значении больше заданного максимума - 100 %
    if (adc >= (MAX_BATTERY_ADC-MIN_BATTERY_ADC))
        return 100;

    // при значении в заданном интервале
    // результат переводится в проценты (1 ступень = 3 %)
    return (adc * 3);
}
	