//////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Настройка ШИМ
// Для датчика температуры MLX90614
// Дата крайнего редактирования 13.04.2017
//////////////////////////////////////////////////////////////////////////////////////////////////////////////

#ifndef	_PWM_H
#define _PWM_H 1

	#include  <avr/io.h>
	#include  "power.h"
	
	// Настройка регистров ШИМ OC0A
    // отношение импульса к периоду  // div 8 	
	#define PWM_INIT() 	do {                                                             \
							   TCCR0A = (1<<COM0A1)|(1<<WGM00);  						\
							   TCCR0B = (1<<CS01);                                     		\
							   OCR0A  = 180;                                           		\
							   POWER_DDR  |= POWER_PWM_PIN;                                 \
							}while(0)

#endif	/* PWM.h */